--ÈÕ³Ì°²ÅÅ
_tmp_calender = {
	weekend = {	--ÖÜÄ©ÈÕ³Ì£¬ÔÚÖÜÎå¡¢Áù¡¢ÈÕ²ÉÓÃ
		--¿ªÊ¼Ê±¼ä£¨·ÖÖÓ£©£¬±ÈÈü³¡Êý
		{18*60, 4},	--µÚÒ»¶Î
		{21*60, 4},	--µÚ¶þ¶Î
	},
	common = {	--Ò»°ãÈÕ³Ì£¬ÔÚÃ»ÓÐÌØ±ð°²ÅÅÊ±²ÉÓÃ
		--¿ªÊ¼Ê±¼ä£¨·ÖÖÓ£©£¬±ÈÈü³¡Êý
		{18*60, 4},
		{21*60, 4},	--µÚ¶þ¶Î
	}
}

--Èü¼¾°²ÅÅ
-- ÀàÐÍ£º1¡¢Ë«ÈË£»2¡¢ÃÅÅÉ£»3¡¢Ê¦Í½£»4¡¢ÈýÈË£»5¡¢»ìºÏµ¥ÈË£»6¡¢Í¬ÏµË«ÈË£»7¡¢»ìºÏË«ÈË
WLLS_SEASON_TB = {
	--[ID]={ÀàÐÍ, 	¿ªÊ¼ÈÕÆÚ,	½áÊøÈÕÆÚ,	²ÎÈü´ÎÊý,	ÈÕ³Ì°²ÅÅ}
	[0] = {2,		0,			0,			0,			{}},	--¿ÕÈü¼¾£¬¼«¶ËÇé¿ö±£»¤
	--[ID]={the loai(1=>7), 	ngay bat dau,	ngay ket thuc,	so tran toi da,	the lich}
	-- 1=   Song ®Êu tù do
	-- 2=  ®¬n ®Êu m«n ph¸i
	-- 3=  song ®Êu s­ ®å
	-- 4=  tam ®Êu tù do
	-- 5= ®¬n ®Êu tù do
	-- 6= song ®Êu cïng hÖ = sau nay bi loai bo
	-- 7= song ®Êu nam nö = sau nay bi loai bo
	-- n¨m 2014
	[40] = {2,		180108,		180128,		48,		_tmp_calender},
	[41] = {5,		180208,		180228,		48,		_tmp_calender},
	[42] = {5,		180308,		180328,		48,		_tmp_calender},
	[43] = {5,		180408,		180428,		48,		_tmp_calender},
	[44] = {5,		180508,		180528,		48,		_tmp_calender},
	[45] = {5,		180608,		180628,		48,		_tmp_calender},
	[46] = {5,		180708,		180728,		48,		_tmp_calender},
	[47] = {5,		180808,		180828,		48,		_tmp_calender},
	[48] = {5,		180908,		180928,		48,		_tmp_calender},
	[49] = {5,		181008,		181028,		48,		_tmp_calender},
	[50] = {5,		181108,		181128,		48,		_tmp_calender},
	[51] = {5,		181208,		181228,		48,		_tmp_calender},
	
	--n¨m 2015
	[52] = {5,		190108,		190128,		48,		_tmp_calender},
	[53] = {5,		190208,		190228,		48,		_tmp_calender},
	[54] = {5,		190308,		190328,		48,		_tmp_calender},
	[55] = {5,		190408,		190428,		48,		_tmp_calender},
	[56] = {5,		190508,		190528,		48,		_tmp_calender},
	[57] = {5,		190608,		190628,		48,		_tmp_calender},
	[58] = {5,		190708,		190728,		48,		_tmp_calender},
	[59] = {5,		190808,		190828,		48,		_tmp_calender},
	[60] = {5,		190908,		190928,		48,		_tmp_calender},
	[61] = {5,		191008,		191028,		48,		_tmp_calender},
	[62] = {5,		191108,		191128,		48,		_tmp_calender},
	[63] = {5,		191208,		191228,		48,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2012 - modified By DinhHQ -2120109
	[64] = {5,		200108,		200128,		48,		_tmp_calender},
	[65] = {5,		200208,		200228,		48,		_tmp_calender},
	[66] = {5,		200308,		200328,		48,		_tmp_calender},
	[67] = {5,		200408,		200428,		48,		_tmp_calender},
	[68] = {5,		200508,		200528,		48,		_tmp_calender},
	[69] = {5,		200608,		200628,		48,		_tmp_calender},
	[70] = {5,		200708,		200728,		48,		_tmp_calender},
	[71] = {5,		200808,		200828,		48,		_tmp_calender},
	[72] = {5,		200908,		200928,		48,		_tmp_calender},
	[73] = {5,		201008,		201028,		48,		_tmp_calender},
	[74] = {5,		201108,		201128,		48,		_tmp_calender},
	[75] = {5,		201208,		201228,		48,		_tmp_calender},
}

--½áÎ²Á½¸ö¿ÕÈü¼¾±ÜÃâ¼«¶ËÇé¿ö
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999998,	999998,	0,	_tmp_calender}
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999999,	999999,	0,	_tmp_calender}

