--NpcËÀÍö½Å±¾
IncludeLib("BATTLE")
Include("\\script\\battles\\battlehead.lua")
Include("\\script\\battles\\guozhan\\head.lua")

ITEM_DROPRATE_TABLE = { 
						{ { 6,1,156,1,0,0 }, { 0.003,0.0200,0.0520,0.0400,0.0500,0.0600 } },	-- Õ½¹Ä
						{ { 6,1,157,1,0,0 }, { 0.003,0.0200,0.0520,0.0400,0.0500,0.0600 } },	-- ÁîÆì
						{ { 6,1,158,1,0,0 }, { 0.003,0.0200,0.0300,0.0400,0.0500,0.0600 } },	-- ºÅ½Ç
						{ { 6,1,160,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0360 } },	-- ½ðÖ®Õ½»ê
						{ { 6,1,161,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0360 } },	-- Ä¾Ö®Õ½»ê
						{ { 6,1,162,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0360 } },	-- Ë®Ö®Õ½»ê
						{ { 6,1,163,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0360 } },	-- »ðÖ®Õ½»ê
						{ { 6,1,164,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0360 } },	-- ÍÁÖ®Õ½»ê
						{ { 6,1,165,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0120 } },	-- ½ðÖ®»¤¼×
						{ { 6,1,166,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0120 } },	-- Ä¾Ö®»¤¼×
						{ { 6,1,167,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0120 } },	-- Ë®Ö®»¤¼×
						{ { 6,1,168,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0120 } },	-- »ðÖ®»¤¼×
						{ { 6,1,169,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0376,0.0120 } },	-- ÍÁÖ®»¤¼×
						{ { 6,1,170,1,0,0 }, { 0.002,0.0360,0.0180,0.0390,0.0140,0.0360 } },	-- ½ðÖ®ÀûÈÐ
						{ { 6,1,171,1,0,0 }, { 0.002,0.0360,0.0180,0.0390,0.0140,0.0360 } },	-- Ä¾Ö®ÀûÈÐ
						{ { 6,1,172,1,0,0 }, { 0.002,0.0360,0.0180,0.0390,0.0140,0.0360 } },	-- Ë®Ö®ÀûÈÐ
						{ { 6,1,173,1,0,0 }, { 0.002,0.0360,0.0180,0.0390,0.0140,0.0360 } },	-- »ðÖ®ÀûÈÐ
						{ { 6,1,174,1,0,0 }, { 0.002,0.0360,0.0180,0.0390,0.0140,0.0360 } },	-- ÍÁÖ®ÀûÈÐ
						{ { 6,1,175,1,0,0 }, { 0.002,0.0200,0.0400,0.0390,0.0140,0.0120 } },	-- ÐÐ¾üµ¤
						{ { 6,1,176,1,0,0 }, { 0.002,0.0200,0.0400,0.0390,0.0140,0.0120 } },	-- Ð¡»¹µ¤
						{ { 6,1,177,1,0,0 }, { 0.002,0.0200,0.0400,0.0390,0.0140,0.0120 } },	-- Îå»¨Â¶
						{ { 6,1,178,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÍâÆÕÍè
						{ { 6,1,179,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÍâ¶¾Íè
						{ { 6,1,180,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÍâ±ùÍè
						{ { 6,1,181,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÄÚÆÕÍè
						{ { 6,1,182,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÄÚ¶¾Íè
						{ { 6,1,183,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÄÚ±ùÍè
						{ { 6,1,184,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÄÚ»ðÍè
						{ { 6,1,185,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÄÚµçÍè
						{ { 6,1,186,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ³¤ÃüÍè
						{ { 6,1,187,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ¼ÓÅÜÍè
						{ { 6,1,188,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ¸ßÉÁÍè
						{ { 6,1,189,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ¸ßÖÐÍè
						{ { 6,1,190,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ·ÉËÙÍè
						{ { 6,1,191,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÆÕ·ÀÍè
						{ { 6,1,192,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ±ù·ÀÍè
						{ { 6,1,193,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃÀ×·ÀÍè
						{ { 6,1,194,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ»ð·ÀÍè
						{ { 6,1,195,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ËÎ½ð×¨ÓÃ¶¾·ÀÍè
						{ { 6,1,207,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0360 } },	-- ¼²·çÖ®Ñ¥	
						{ { 6,1,209,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0360 } },	-- °×¾Ô»¤Íó	
						{ { 6,1,210,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	-- ºóôàÖ®ÑÛ	
						{ { 6,1,211,1,0,0 }, { 0.002,0.0200,0.0130,0.0160,0.0140,0.0120 } },	-- ÎÊºÅ
						{ { 6,1,208,1,0,0 }, { 0.002,0.0200,0.0180,0.0160,0.0140,0.0120 } },	--ÈýÇåÖ®Æø
						{ { 6,1,212,1,0,0 }, { 0.003,0.0200,0.0150,0.0200,0.0200,0.0200 } },	--ÐÅ¸ë
						{ { 6,1,214,1,0,0 }, { 0.003,0.0200,0.0520,0.0200,0.0200,0.0200 } },	--¿¹µ¯Ö®½Ç
					  }
					  
NPC_RANK_DROPRATE_TABLE = { 1, 1, 2, 3, 4, 5 }

PLAYER_BASE_BONUS1 = 1000
PLAYER_BASE_BONUS2 = 500

BONUS_BOSS_DOWN_PLAYER  = 1000
BONUS_BOSS_DOWN_TEAM	= 10000

function OnDeath( nNpcIndex )
	State = GetMissionV(MS_STATE) ;
	if (State ~= 2) then
		return
	end
	
	--Èç¹ûÊÇËÀÓÚÆäËüNpcÔò²»Í³¼ÆÅÅÐÐ
	if (PlayerIndex == nil or PlayerIndex == 0) then
		return
	end
	
	dropItem( nNpcIndex, rank, PlayerIndex );
	
	BT_SetData(PL_KILLNPC, BT_GetData(PL_KILLNPC) + 1);
	BT_SetData(PL_KILLRANK1 + rank - 1, BT_GetData(PL_KILLRANK1 + rank - 1) + 1);
	bt_addtotalpoint(BT_GetTypeBonus(PL_KILLRANK1 + rank - 1, GetCurCamp()))
	mar_addmissionpoint(BT_GetTypeBonus(PL_KILLRANK1 + rank - 1, GetCurCamp()))
	
	if (rank == 6) then
		
		bt_addtotalpoint(BONUS_BOSS_DOWN_PLAYER)--¼Ó·Ö
		mar_addmissionpoint(BONUS_BOSS_DOWN_TEAM)--¼Ó·Ö
		Msg2Player("B¹n nhËn ®­îc "..BONUS_BOSS_DOWN_PLAYER.." ®iÓm tÝch lòy!")
		
		if (GetCurCamp() == 1) then
			Msg2MSAll(MISSIONID, "<color=yellow> Tèng Kim c«ng c¸o: Tèng qu©n "..GetName().." ®· giÕt ®­îc Nguyªn So¸i phe Kim!!!")
			
			if(GetMissionV(MS_MARSHALDEATH) == 2 ) then 
				SetMissionV(MS_MARSHALDEATH, 0)--ÉèÖÃÊ¤¸º
			else
				SetMissionV(MS_MARSHALDEATH, 1);
			end			
					
		else
			Msg2MSAll(MISSIONID, "<color=yellow> Tèng Kim c«ng c¸o: Kim qu©n "..GetName().." ®· giÕt ®­îc Nguyªn So¸i phe Tèng!!!")
			
			if(GetMissionV(MS_MARSHALDEATH) == 1 ) then 
				SetMissionV(MS_MARSHALDEATH, 0)--ÉèÖÃÊ¤¸º
			else
				SetMissionV(MS_MARSHALDEATH, 2);
			end	
			
		end
		

	end

	BT_SortLadder()
	BT_BroadSelf()
end;

function dropItem( nNpcIndex, nNpcRank, nBelongPlayerIdx )
	local nItemCount = getn( ITEM_DROPRATE_TABLE );
	local nMpsX, nMpsY, nSubWorldIdx = GetNpcPos( nNpcIndex );
	
	for nDropTimes = 1, NPC_RANK_DROPRATE_TABLE[nNpcRank] do
		local nRandNum = random();
		local nSum = 0;
		for i = 1, nItemCount do
			nSum = nSum + ITEM_DROPRATE_TABLE[i][2][nNpcRank];
			if( nSum > nRandNum ) then
				DropItem( nSubWorldIdx, nMpsX, nMpsY, nBelongPlayerIdx, ITEM_DROPRATE_TABLE[i][1][1], ITEM_DROPRATE_TABLE[i][1][2], ITEM_DROPRATE_TABLE[i][1][3], ITEM_DROPRATE_TABLE[i][1][4], ITEM_DROPRATE_TABLE[i][1][5], ITEM_DROPRATE_TABLE[i][1][6], ITEM_DROPRATE_TABLE[i][1][7] );
				break
			end
		end
	end
end